rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
// ============================================================
// 6b. LOG CRUDO IMÁN POR IMÁN (para CSV, no usado por el PID)
// ============================================================
#define PULSE_LOG_SIZE 32

struct PulseSample {
  uint32_t periodo_us;  // período crudo entre este imán y el anterior
  float    rpm;         // RPM instantánea calculada de ese período
  float    vel_m_s;     // velocidad lineal instantánea de ese período
};

static PulseSample pulseLogBuffer[PULSE_LOG_SIZE];
static uint8_t     pulseLogCount    = 0;
static bool        pulseLogOverflow = false;

// ============================================================
// 7. ENCODER KY-040
// ============================================================
ESP32Encoder encoder;
int           lastStableCount    = 0;
unsigned long lastStableTime     = 0;
const unsigned long ENCODER_STABILITY_DELAY_MS = 5;
int           displayEncoderCount = 0;

// Botón: se lee por polling (no interrupción) para poder distinguir un
// click corto (confirmar setpoint / navegar menú) de uno mantenido
// DEV_MENU_HOLD_MS (abre/cierra el menú de desarrollador).
bool          buttonIsDown         = false;
unsigned long buttonDownSinceMs    = 0;
bool          longPressFired       = false;
unsigned long lastButtonDebounce   = 0;
const unsigned long ENCODER_BUTTON_DEBOUNCE_MS = 50;
#define DEV_MENU_HOLD_MS 10000UL

// ============================================================
// 7b. MENÚ DESARROLLADOR (edición de Kp/Ki/Kd en vivo desde el LCD)
// ============================================================
enum DevMenuState : uint8_t { DEV_MENU_OFF, DEV_MENU_SELECT, DEV_MENU_EDIT };

static DevMenuState devMenuState  = DEV_MENU_OFF;
static uint8_t       devMenuIndex = 0;   // índice del parámetro seleccionado

static const char* const DEV_MENU_ITEMS[] = { "Kp", "Ki", "Kd", "SALIR" };
static const uint8_t  DEV_MENU_ITEM_COUNT = 4;
static const double   DEV_MENU_STEP[]     = { 0.1, 0.1, 0.1 }; // por click, Kp/Ki/Kd

// ============================================================
// 8. PARADA DE EMERGENCIA
// ============================================================
volatile bool emergencyStopTriggered = false;
bool          emergencyStopPending   = false;
unsigned long lastEmergencyDebounce  = 0;
const unsigned long EMERGENCY_DEBOUNCE_MS = 100;

// ============================================================
// 9. CORRIENTE
// ============================================================
float         cachedCurrent       = 0.0f;
unsigned long lastCurrentReadTime = 0;

// ============================================================
// 10. LCD
// ============================================================
LiquidCrystal_I2C* lcd        = nullptr;
unsigned long      lastLcdUpdate = 0;

// ============================================================
// 11. SERIAL
// ============================================================
static char    serialBuf[64];
static uint8_t serialIdx = 0;
unsigned long  lastDebugTime = 0;

// ============================================================
// 12. LED
// ============================================================
#define LED_BUILTIN_PIN 2
unsigned long lastBlink = 0;

// ============================================================
// 13. DECLARACIONES ANTICIPADAS
// ============================================================
void broadcastState();
void motorStop();
void computePID();

// ============================================================
// 14. IMPLEMENTACIÓN DE FUNCIONES
// ============================================================

// applyPWM: escribe el duty cycle (0..MAX_VELOCITY) en el canal PWM del driver
void applyPWM(int pwmVal) {
  pwmVal = constrain(pwmVal, 0, MAX_VELOCITY);
#if ESP_IDF_VERSION_MAJOR >= 5
  ledcWrite(MOTOR_PWM_PIN, (uint32_t)pwmVal);
#else
  ledcWrite(PWM_CHANNEL, (uint32_t)pwmVal);
#endif
}

// configurarMotorReversa: fija los pines IN1/IN2 del driver para girar en el
// sentido usado por la cinta (única dirección que usa este proyecto)
void configurarMotorReversa() {
  digitalWrite(MOTOR_IN1_PIN, LOW);
  digitalWrite(MOTOR_IN2_PIN, HIGH);
}

// motorParadaLibre: pone ambos pines IN1/IN2 en LOW (coast / parada libre, sin frenado activo)
void motorParadaLibre() {
  digitalWrite(MOTOR_IN1_PIN, LOW);
  digitalWrite(MOTOR_IN2_PIN, LOW);
}

// ---------------------
// motorStop: apaga motor, reset PID manual
// ---------------------
void motorStop() {
  setpointSpeed   = 0.0f;
  pendingSetpoint = 0.0f;
  setpointPending = false;
  pidOutput       = 0.0f;
  applyPWM(0);
  motorParadaLibre();

  // Resetear PID (MANUAL + Output=0 → próximo SetMode(AUTOMATIC) arranca desde 0)
  myPID.SetMode(MANUAL);
  pidOut      = 0.0;
  pidIntegral = 0.0f;
  Serial.println("[PID] Motor detenido — PID reset");
}

// ---------------------
// activarPID: configura setpoint y arranca el PID
// ---------------------
static void activarPID(float sp) {
  pidSp = sp;
  pidIn = currentLinearSpeedMs;

  // Semilla del integrador: al pasar MANUAL→AUTOMATIC la librería toma
  // pidOut como ITerm inicial, así el PID arranca en PID_STARTUP_PWM en
  // vez de rampear desde 0.
  pidOut = PID_STARTUP_PWM;
  myPID.SetMode(AUTOMATIC);
  lastControlMicros = micros();

  Serial.printf("[PID] Activado — SP: %.3f m/s\n", sp);
}

// ---------------------
// computePID: delega en PID de Brett Beauregard (maneja timing internamente)
// ---------------------
void computePID() {
  if (setpointSpeed == 0.0f) {
    pidOutput = 0.0f;
    return;
  }

  pidIn = currentLinearSpeedMs;
  pidSp = setpointSpeed;

  if (myPID.Compute()) {
    pidOutput = (float)pidOut;
    applyPWM((int)round(pidOutput));
    lastControlMicros = micros();  // actualiza el fallback timer
  }
}

// ---------------------
// confirmarSetpoint: aplica setpoint pendiente del encoder
// ---------------------
void confirmarSetpoint() {
  if (!setpointPending) return;

  setpointSpeed = constrain(pendingSetpoint, 0.0f, 2.0f);
  setpointPending = false;

  if (setpointSpeed == 0.0f) {
    motorStop();
    Serial.println("[ENCODER] Setpoint confirmado: 0 — Motor detenido");
  } else {
    configurarMotorReversa();
    activarPID(setpointSpeed);
    Serial.printf("[ENCODER] Setpoint confirmado: %.3f m/s\n", setpointSpeed);
  }

  broadcastState();
}

// ---------------------
// toggleDevMenu: abre/cierra el menú de desarrollador (mantener botón 10s)
// ---------------------
static void toggleDevMenu() {
  if (devMenuState == DEV_MENU_OFF) {
    devMenuState = DEV_MENU_SELECT;
    devMenuIndex = 0;
    Serial.println("[DEVMENU] Abierto — ajustá Kp/Ki/Kd en vivo desde el LCD");
  } else {
    devMenuState = DEV_MENU_OFF;
    Serial.println("[DEVMENU] Cerrado");
  }
  if (lcd) lcd->clear();
}

// ---------------------
// aplicarDeltaDevMenu: ajusta el parámetro seleccionado y lo aplica al PID en vivo
// ---------------------
static void aplicarDeltaDevMenu(int delta) {
  double* param = (devMenuIndex == 0) ? &Kp : (devMenuIndex == 1) ? &Ki : &Kd;
  *param += DEV_MENU_STEP[devMenuIndex] * delta;
  if (*param < 0.0) *param = 0.0;
  myPID.SetTunings(Kp, Ki, Kd);
  Serial.printf("[DEVMENU] %s=%.2f\n", DEV_MENU_ITEMS[devMenuIndex], *param);
}

// ---------------------
// clickCortoEncoder: click corto del botón — su efecto depende del modo actual
// ---------------------
static void clickCortoEncoder() {
  if (devMenuState == DEV_MENU_OFF) {
    confirmarSetpoint();
  } else if (devMenuState == DEV_MENU_SELECT) {
    if (devMenuIndex == DEV_MENU_ITEM_COUNT - 1) {  // "SALIR"
      devMenuState = DEV_MENU_OFF;
      Serial.println("[DEVMENU] Cerrado");
    } else {
      devMenuState = DEV_MENU_EDIT;
    }
    if (lcd) lcd->clear();
  } else { // DEV_MENU_EDIT
    devMenuState = DEV_MENU_SELECT;
    if (lcd) lcd->clear();
  }
}

// ---------------------
// procesarEntradasEncoder: rotación (setpoint o navegación del menú dev) +
// botón por polling (click corto / mantenido 10s)
// ---------------------
void procesarEntradasEncoder() {
  int rawCount        = encoder.getCount();
  unsigned long ahora  = millis();
  int delta            = 0;

  if (rawCount != lastStableCount) {
    lastStableTime  = ahora;
    lastStableCount = rawCount;
  }

