rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
  if ((ahora - lastStableTime) >= ENCODER_STABILITY_DELAY_MS) {
    int newDisplayCount = rawCount / 2;
    if (newDisplayCount != displayEncoderCount) {
      delta = newDisplayCount - displayEncoderCount;
      displayEncoderCount = newDisplayCount;
    }
  }

  if (delta != 0) {
    if (devMenuState == DEV_MENU_SELECT) {
      devMenuIndex = (uint8_t)((devMenuIndex + delta + DEV_MENU_ITEM_COUNT) % DEV_MENU_ITEM_COUNT);
    } else if (devMenuState == DEV_MENU_EDIT) {
      aplicarDeltaDevMenu(delta);
    } else {
      pendingSetpoint += delta * 0.05f;
      pendingSetpoint  = constrain(pendingSetpoint, 0.0f, 2.0f);
      setpointPending  = true;

      Serial.printf("[ENCODER] Setpoint temporal: %.3f m/s (delta: %d)\n",
                    pendingSetpoint, delta);
      broadcastState();
    }
  }

  // Botón por polling: distingue click corto (confirma al soltar antes de
  // los 10s) de mantenido (dispara el menú dev apenas se cumplen los 10s,
  // sin esperar a que se suelte).
  bool rawPressed = (digitalRead(ENCODER_SW_PIN) == LOW);

  if (rawPressed && !buttonIsDown) {
    if (ahora - lastButtonDebounce > ENCODER_BUTTON_DEBOUNCE_MS) {
      buttonIsDown       = true;
      buttonDownSinceMs  = ahora;
      longPressFired     = false;
      lastButtonDebounce = ahora;
    }
  } else if (rawPressed && buttonIsDown) {
    if (!longPressFired && (ahora - buttonDownSinceMs) >= DEV_MENU_HOLD_MS) {
      longPressFired = true;
      toggleDevMenu();
    }
  } else if (!rawPressed && buttonIsDown) {
    buttonIsDown = false;
    if (!longPressFired) {
      clickCortoEncoder();
    }
  }
}

// ============================================================
// 15. ISRs
// ============================================================
// ISR_SensorHall: en cada flanco del sensor Hall mide el período respecto al
// pulso anterior y, si supera el debounce dinámico, lo guarda en el buffer circular
void IRAM_ATTR ISR_SensorHall() {
  uint32_t ahora = micros();

  if (lastHallMicros == 0) {
    lastHallMicros = ahora;
    return;
  }

  uint32_t periodo = ahora - lastHallMicros;

  if (periodo >= hallMinPeriodUs) {
    lastHallMicros = ahora;
    hallPeriodBuffer[hallBufferHead] = periodo;
    hallBufferHead = (hallBufferHead + 1) % HALL_BUFFER_SIZE;
    if (hallBufferCount < HALL_BUFFER_SIZE) hallBufferCount++;
  }
  // Pulso espurio: NO se avanza lastHallMicros, así el próximo flanco real
  // mide el período completo desde el último pulso válido (evita que el
  // rebote parta el período en dos fragmentos cortos).
}

// ISR_EmergencyStop: levanta la bandera de parada de emergencia; el loop() la procesa
void IRAM_ATTR ISR_EmergencyStop() {
  emergencyStopTriggered = true;
}

// ============================================================
// 16. CÁLCULO DE VELOCIDAD + PID EVENT-DRIVEN
// ============================================================
// getMedian: copia y ordena hasta `size` muestras del buffer para devolver la mediana
static float getMedian(uint32_t* arr, uint8_t size, uint8_t count) {
  uint32_t temp[FILTER_SIZE];
  uint8_t  n = (count < size) ? count : size;
  if (n == 0) return 0.0f;
  memcpy(temp, arr, n * sizeof(uint32_t));
  std::sort(temp, temp + n);
  return (float)temp[n / 2];
}

// Empuja una muestra cruda (sin filtrar) al log imán por imán.
static void logPulsoCrudo(uint32_t periodo_us, float rpm, float vel_m_s) {
  if (pulseLogCount >= PULSE_LOG_SIZE) {
    pulseLogOverflow = true;
    return;
  }
  pulseLogBuffer[pulseLogCount].periodo_us = periodo_us;
  pulseLogBuffer[pulseLogCount].rpm        = rpm;
  pulseLogBuffer[pulseLogCount].vel_m_s    = vel_m_s;
  pulseLogCount++;
}

// calculateSpeed: procesa los pulsos Hall nuevos desde el último ciclo — actualiza
// RPM/velocidad filtrada (mediana), la velocidad de display, el log crudo para el
// WebSocket, maneja el timeout (sin pulsos = velocidad 0) y dispara computePID()
static void calculateSpeed() {
  uint32_t periods[HALL_BUFFER_SIZE];
  uint8_t  currentHead;
  uint32_t ultimoPulso;

  portDISABLE_INTERRUPTS();
  memcpy(periods, (const void*)hallPeriodBuffer, sizeof(periods));
  currentHead  = hallBufferHead;
  ultimoPulso  = lastHallMicros;
  portENABLE_INTERRUPTS();

  bool timeout = (ultimoPulso == 0) || ((micros() - ultimoPulso) > HALL_TIMEOUT_US);

  if (timeout) {
    currentRPM           = 0.0f;
    currentLinearSpeedMs = 0.0f;
    filteredRPM_Last     = 0.0f;
    filteredVel_Last     = 0.0f;

    memset(filterBuffer, 0, sizeof(filterBuffer));
    filterCount = 0;
    filterIndex = 0;
    lastNormalPeriodUs = 0;

    memset(revPeriodBuffer, 0, sizeof(revPeriodBuffer));
    revBufIndex    = 0;
    revBufCount    = 0;
    revPeriodSum   = 0;
    displaySpeedMs = 0.0f;
    magnetCount    = 0;

    portDISABLE_INTERRUPTS();
    hallBufferCount   = 0;
    hallBufferHead    = 0;
    lastProcessedHead = 0;
    lastHallMicros    = 0;  // reset: el próximo imán será la referencia, el siguiente se mide
    hallMinPeriodUs   = HALL_DEBOUNCE_US;  // vuelve al piso hasta tener mediana nueva
    memset((void*)hallPeriodBuffer, 0, sizeof(hallPeriodBuffer));
    portENABLE_INTERRUPTS();

    // Tras timeout: Brett PID retoma en el próximo Compute() con Input~0
    return;
  }

  uint8_t prevProcessedHead = lastProcessedHead;
  uint8_t newPulses = (currentHead - prevProcessedHead + HALL_BUFFER_SIZE) % HALL_BUFFER_SIZE;
  lastProcessedHead = currentHead;

  if (newPulses == 0) return;

  // Acumular períodos crudos válidos en array local para CSV post-EMA
  uint32_t rawPeriods[HALL_BUFFER_SIZE];
  uint8_t  validCount = 0;

  // Procesar cada nuevo pulso
  bool revCompleted = false;
  for (uint8_t i = 0; i < newPulses; i++) {
    uint8_t  idx = (prevProcessedHead + i) % HALL_BUFFER_SIZE;
    uint32_t p   = periods[idx];
    if (p > HALL_DEBOUNCE_US && p < HALL_TIMEOUT_US) {

      // Diente faltante: el hueco del imán ausente mide ~2x un período
      // normal. Se compara contra el ÚLTIMO período normal individual
      // (no una mediana/promedio de varios) para no atrasarse durante una
      // aceleración fuerte, donde los períodos se acortan rápido pulso a
      // pulso — una mediana de 3 vieja subestimaría el umbral y dejaría
      // pasar el hueco real como si fuera normal, ensuciando el filtro.
      bool esHueco = (lastNormalPeriodUs > 0) &&
                     ((float)p > 1.5f * (float)lastNormalPeriodUs);

      if (esHueco) {
        magnetCount  = 0;
        revCompleted = true;
        if (hallDebugActive) {
          Serial.printf("[HALL] -- HUECO (diente faltante) p=%luus ref=%luus -- vuelta sincronizada\n",
                        (unsigned long)p, (unsigned long)lastNormalPeriodUs);
        }
        // El hueco equivale a 2 slots: se loguea con el período a la mitad
        // para que el CSV/WS muestren una velocidad instantánea coherente,
        // pero NO entra al filtro de mediana ni a la ventana de display
        // (no es una muestra de 1 slot).
        logPulsoCrudo(p, HALL_CONST_RPM / (p / 2.0f), HALL_CONST_SPEED / (p / 2.0f));
      } else {
        lastNormalPeriodUs = p;

