rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
        filterBuffer[filterIndex] = p;
        filterIndex = (filterIndex + 1) % FILTER_SIZE;
        if (filterCount < FILTER_SIZE) filterCount++;

        rawPeriods[validCount++] = p;

        // Ventana deslizante de 1 vuelta para la velocidad de display
        // (MAGNETS_COUNT-1 períodos normales por vuelta; el hueco no cuenta)
        revPeriodSum -= revPeriodBuffer[revBufIndex];
        revPeriodBuffer[revBufIndex] = p;
        revPeriodSum += p;
        revBufIndex = (revBufIndex + 1) % (MAGNETS_COUNT - 1);
        if (revBufCount < (MAGNETS_COUNT - 1)) revBufCount++;

        // Log WebSocket (imán por imán)
        float rawRpmSample = HALL_CONST_RPM   / (float)p;
        float rawVelSample = HALL_CONST_SPEED / (float)p;
        logPulsoCrudo(p, rawRpmSample, rawVelSample);

        // Monitor de imanes
        magnetCount++;
        if (hallDebugActive) {
          Serial.printf("[HALL] %u/%u  p=%luus  v=%.3fm/s\n",
                        magnetCount, (uint8_t)(MAGNETS_COUNT - 1),
                        (unsigned long)p, HALL_CONST_SPEED / (float)p);
        }
        // Red de seguridad: si por algún motivo no se detectó el hueco a
        // tiempo, igual sincroniza tras contar los períodos normales de 1 vuelta.
        if (magnetCount >= (MAGNETS_COUNT - 1)) {
          magnetCount  = 0;
          revCompleted = true;
        }
      }
    }
  }

  if (filterCount == 0) return;

  // Calcular velocidad filtrada (mediana + EMA)
  float periodoMediano = getMedian(filterBuffer, FILTER_SIZE, filterCount);

  // Actualizar umbral del debounce dinámico (leído por la ISR)
  uint32_t nuevoUmbral = (uint32_t)(HALL_DEBOUNCE_RATIO * periodoMediano);
  if (nuevoUmbral < HALL_DEBOUNCE_US)     nuevoUmbral = HALL_DEBOUNCE_US;
  if (nuevoUmbral > HALL_DEBOUNCE_MAX_US) nuevoUmbral = HALL_DEBOUNCE_MAX_US;
  hallMinPeriodUs = nuevoUmbral;

  float rawRPM = HALL_CONST_RPM   / periodoMediano;
  float rawVel = HALL_CONST_SPEED / periodoMediano;

  filteredRPM_Last = (SMOOTH_ALPHA * rawRPM) + ((1.0f - SMOOTH_ALPHA) * filteredRPM_Last);
  filteredVel_Last = (SMOOTH_ALPHA * rawVel) + ((1.0f - SMOOTH_ALPHA) * filteredVel_Last);

  currentRPM           = filteredRPM_Last;
  currentLinearSpeedMs = filteredVel_Last;

  // --- LOG VEL: una línea por actualización con la velocidad filtrada que
  // efectivamente ve el PID (currentLinearSpeedMs) — para graficar vel(t)
  // y validar el sensor, a diferencia de LOG START que loguea velocidad
  // cruda sin filtrar, imán por imán.
  if (velLogActive) {
    Serial.printf("%lu,%.4f,%.1f,%.4f,%.0f\n",
      millis(), currentLinearSpeedMs, currentRPM, setpointSpeed, pidOutput);
  }

  // Velocidad de display: promedio sobre la ventana de 1 vuelta.
  // vel = K / (sum/count) = K * count / sum
  if (revPeriodSum > 0) {
    displaySpeedMs = HALL_CONST_SPEED * (float)revBufCount / (float)revPeriodSum;
  }

  if (hallDebugActive && revCompleted) {
    Serial.printf("[HALL] -- vuelta completa | Vel:%.3f m/s | RPM:%.1f\n",
                  currentLinearSpeedMs, currentRPM);
  }

  // --- CSV SERIAL: una línea por imán, con vel filtrada actualizada como referencia ---
  if (csvLogActive && validCount > 0 && setpointSpeed > 0.001f) {
    unsigned long t = millis();
    for (uint8_t i = 0; i < validCount; i++) {
      float velCruda = HALL_CONST_SPEED / (float)rawPeriods[i];
      float errRel   = (velCruda - setpointSpeed) / setpointSpeed;
      Serial.printf("%lu,%lu,%.4f,%.4f,%.4f\n",
        t, (unsigned long)rawPeriods[i],
        velCruda, setpointSpeed, errRel);
    }
  }

  // --- EJECUTAR PID MANUAL (event-driven) CADA VEZ QUE HAY UN PULSO ---
  computePID();
}

// ============================================================
// 17. LECTURA DE CORRIENTE
// ============================================================
// updateCurrentReading: promedia 20 lecturas del sensor de corriente (cada CURRENT_READ_INTERVAL)
// y las convierte a amperes usando el offset y la sensibilidad del sensor
static void updateCurrentReading() {
  if (millis() - lastCurrentReadTime < CURRENT_READ_INTERVAL) return;
  lastCurrentReadTime = millis();

  uint32_t sum = 0;
  for (int i = 0; i < 20; i++) sum += analogRead(MOTOR_CS_PIN);

  float voltage   = (sum / 20.0f) * (3.3f / 4095.0f);
  float corrected = max(voltage - CS_OFFSET_VOLTAGE, 0.0f);
  cachedCurrent   = corrected / CS_VOLTAGE_PER_AMP;
}

// ============================================================
// 18. COMANDOS SERIAL
// ============================================================
// procesarComandoSerial: interpreta un comando de texto recibido por Serial
// (SET SP, GET VEL/ENC/CUR, STOP, PWM, TUNE, HALL ON/OFF, LOG START/STOP, HELP)
void procesarComandoSerial(const char* cmd) {
  char buf[64];
  strncpy(buf, cmd, sizeof(buf) - 1);
  buf[sizeof(buf) - 1] = '\0';
  for (char* p = buf; *p; p++) *p = toupper((unsigned char)*p);

  float v1;
  int pwmVal;

  if (strncmp(buf, "SET SP ", 7) == 0 && sscanf(buf + 7, "%f", &v1) == 1) {
    float sp = constrain(v1, 0.0f, 2.0f);
    setpointSpeed   = sp;
    pendingSetpoint = sp;
    setpointPending = false;

    if (sp == 0.0f) {
      motorStop();
      Serial.println("[SP] Motor detenido");
    } else {
      configurarMotorReversa();
      activarPID(sp);
      Serial.printf("[SP] Consigna: %.3f m/s\n", sp);
    }

  } else if (strcmp(buf, "GET VEL") == 0) {
    float error = setpointSpeed - currentLinearSpeedMs;
    Serial.printf("[VEL] %.3f m/s | SP: %.3f | PWM: %.0f | FF: %.0f | Int: %.3f | Err: %.3f | Ki*Int: %.1f\n",
      currentLinearSpeedMs, setpointSpeed, pidOutput, lastFF_PWM, 
      pidIntegral, error, Ki * pidIntegral);

  } else if (strcmp(buf, "GET ENC") == 0) {
    Serial.printf("[ENC] Raw: %d | Display: %d\n",
      encoder.getCount(), displayEncoderCount);

  } else if (strcmp(buf, "RESET ENC") == 0) {
    encoder.clearCount();
    lastStableCount     = 0;
    displayEncoderCount = 0;
    Serial.println("[ENC] Contadores reseteados");

  } else if (strcmp(buf, "GET CUR") == 0) {
    Serial.printf("[CUR] %.2f A\n", cachedCurrent);

  } else if (strcmp(buf, "STOP") == 0) {
    motorStop();
    Serial.println("[STOP] Motor detenido");

