rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
// ============================================================
// 20. HTTP
// ============================================================
// setupHTTPEndpoints: sirve la SPA (index.html) y el monitor (monitor.html)
// desde LittleFS; sin fallback embebido
void setupHTTPEndpoints() {
  if (LittleFS.begin(true)) {
    server.serveStatic("/", LittleFS, "/").setDefaultFile("index.html");
    Serial.println("[FS] LittleFS OK");
  } else {
    Serial.println("[FS] LittleFS no disponible");
  }
}

// ============================================================
// 21. LCD
// ============================================================
// scanI2CAddress: barre el bus I2C buscando una dirección conocida de LCD (0x27 o 0x3F)
uint8_t scanI2CAddress() {
  for (uint8_t addr = 0x20; addr < 0x40; addr++) {
    Wire.beginTransmission(addr);
    if (Wire.endTransmission() == 0) {
      if (addr == 0x27 || addr == 0x3F) return addr;
    }
  }
  return 0;
}

// initLCD: inicializa el bus I2C, detecta la dirección del LCD y lo deja listo para usar
void initLCD() {
  if (lcd) return;
  Wire.begin(LCD_SDA_PIN, LCD_SCL_PIN);
  Wire.setClock(400000);
  uint8_t addr = scanI2CAddress();
  if (!addr) { Serial.println("[LCD] No I2C device"); return; }
  lcd = new LiquidCrystal_I2C(addr, 16, 2);
  lcd->init();
  lcd->backlight();
  lcd->clear();
  Serial.printf("[LCD] OK @ 0x%02X\n", addr);
}

// updateLCD: refresca la pantalla (cada LCD_UPDATE_INTERVAL) con setpoint,
// velocidad, PWM y corriente actuales
void updateLCD() {
  if (!lcd) return;
  if (millis() - lastLcdUpdate < LCD_UPDATE_INTERVAL) return;
  lastLcdUpdate = millis();

  char row0[17];
  char row1[17];

  if (setpointPending) {
    snprintf(row0, sizeof(row0), "SP:%-4.2f*->%-4.2f", setpointSpeed, pendingSetpoint);
  } else {
    snprintf(row0, sizeof(row0), "SP:%-4.2f V:%-4.2f", setpointSpeed, displaySpeedMs);
  }
  lcd->setCursor(1, 0);
  lcd->print(row0);

  snprintf(row1, sizeof(row1), "PWM:%-4d I:%-4.2fA", (int)round(pidOutput), cachedCurrent);
  lcd->setCursor(1, 1);
  lcd->print(row1);
}

// updateLCDDevMenu: pantalla del menú de desarrollador (navegar/editar Kp/Ki/Kd)
void updateLCDDevMenu() {
  if (!lcd) return;
  if (millis() - lastLcdUpdate < LCD_UPDATE_INTERVAL) return;
  lastLcdUpdate = millis();

  char line0[16];
  char line1[16];
  char row0[17];
  char row1[17];

  if (devMenuState == DEV_MENU_SELECT) {
    snprintf(line0, sizeof(line0), ">%s", DEV_MENU_ITEMS[devMenuIndex]);
    if (devMenuIndex == DEV_MENU_ITEM_COUNT - 1) {
      snprintf(line1, sizeof(line1), "OK=salir");
    } else {
      double val = (devMenuIndex == 0) ? Kp : (devMenuIndex == 1) ? Ki : Kd;
      snprintf(line1, sizeof(line1), "%.2f OK=edit", val);
    }
  } else { // DEV_MENU_EDIT
    double val = (devMenuIndex == 0) ? Kp : (devMenuIndex == 1) ? Ki : Kd;
    snprintf(line0, sizeof(line0), "EDIT %s", DEV_MENU_ITEMS[devMenuIndex]);
    snprintf(line1, sizeof(line1), "%.2f OK=fin", val);
  }

  // Padding fijo a 15 columnas (fila visible real: setCursor arranca en
  // columna 1 de 16) para pisar siempre lo que haya quedado de la vuelta
  // anterior, sin importar cuánto más corto sea el texto nuevo.
  snprintf(row0, sizeof(row0), "%-15s", line0);
  snprintf(row1, sizeof(row1), "%-15s", line1);

  lcd->setCursor(1, 0);
  lcd->print(row0);
  lcd->setCursor(1, 1);
  lcd->print(row1);
}

// ============================================================
// 22. DEBUG SERIAL
// ============================================================
// debugSerial: imprime por Serial un resumen periódico (cada DEBUG_INTERVAL) del
// estado de velocidad/PID/corriente, salvo que el log CSV esté activo
void debugSerial() {
  if (csvLogActive || velLogActive) return;
  if (millis() - lastDebugTime < DEBUG_INTERVAL) return;
  lastDebugTime = millis();
  float error = setpointSpeed - currentLinearSpeedMs;
  Serial.printf("[STATS] Vel:%.3f | SP:%.3f | PWM:%.0f | FF:%.0f | Int:%.3f | Ki*Int:%.1f | Err:%.3f | Cur:%.2fA\n",
    currentLinearSpeedMs, setpointSpeed, pidOutput, lastFF_PWM,
    pidIntegral, Ki * pidIntegral, error, cachedCurrent);
}

// ============================================================
// 23. SETUP
// ============================================================
// setup: configura pines de motor/Hall/encoder/emergencia, arranca el PID en MANUAL,
// inicializa LCD, levanta el WiFi AP y el servidor HTTP/WebSocket
void setup() {
  Serial.begin(115200);
  Serial.println("\n[BOOT] Trotadora PID v9.11.0 - Anti-windup simétrico");

  // Motor
  pinMode(MOTOR_IN1_PIN, OUTPUT);
  pinMode(MOTOR_IN2_PIN, OUTPUT);
  motorParadaLibre();

#if ESP_IDF_VERSION_MAJOR >= 5
  ledcAttach(MOTOR_PWM_PIN, PWM_FREQUENCY, PWM_RESOLUTION);
  ledcWrite(MOTOR_PWM_PIN, 0);
#else
  ledcSetup(PWM_CHANNEL, PWM_FREQUENCY, PWM_RESOLUTION);
  ledcAttachPin(MOTOR_PWM_PIN, PWM_CHANNEL);
  ledcWrite(PWM_CHANNEL, 0);
#endif

  pinMode(MOTOR_CS_PIN,   INPUT);
  pinMode(LED_BUILTIN_PIN, OUTPUT);
  digitalWrite(LED_BUILTIN_PIN, LOW);

  // Hall
  pinMode(HALL_SENSOR_PIN, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(HALL_SENSOR_PIN), ISR_SensorHall, FALLING);

  // Encoder
  ESP32Encoder::useInternalWeakPullResistors = puType::up;
  encoder.attachHalfQuad(ENCODER_DT_PIN, ENCODER_CLK_PIN);
  encoder.clearCount();
  encoder.setFilter(1023);

  lastStableCount     = 0;
  lastStableTime      = millis();
  displayEncoderCount = 0;
  pendingSetpoint     = 0.0f;
  setpointPending     = false;

  Serial.println("[ENCODER] Inicializado — HALF_QUAD");

  // Botón del encoder (se lee por polling en procesarEntradasEncoder, no interrupción)
  pinMode(ENCODER_SW_PIN, INPUT_PULLUP);

  // Emergencia
  pinMode(EMERGENCY_STOP_PIN, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(EMERGENCY_STOP_PIN), ISR_EmergencyStop, FALLING);

  // PID Brett Beauregard — arranca en reposo
  myPID.SetOutputLimits(PID_OUTPUT_MIN, PID_OUTPUT_MAX);
  myPID.SetSampleTime(PID_TIMER_INTERVAL_MS);
  myPID.SetMode(MANUAL);  // permanece en MANUAL hasta activarPID()
  pidOut            = 0.0;
  pidOutput         = 0.0f;
  pidIntegral       = 0.0f;
  lastControlMicros = micros();

  Serial.printf("[PID] Brett Beauregard | Kp=%.2f Ki=%.2f Kd=%.2f | PWM:[%d..%d] | Sample:%lums\n",
                Kp, Ki, Kd, PID_OUTPUT_MIN, PID_OUTPUT_MAX, PID_TIMER_INTERVAL_MS);
  Serial.println("[PID] Esperando setpoint...");

