rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
  // LCD
  initLCD();
  if (lcd) {
    lcd->setCursor(1, 0); lcd->print("TROTADORA v9.11.0");
    lcd->setCursor(1, 1); lcd->print("ANTI-WINDUP");
    delay(1500);
    lcd->clear();
  }

  // WiFi AP
  WiFi.mode(WIFI_AP);
  WiFi.softAP(ssid, apPassword);
  Serial.printf("[WiFi] AP: %s | IP: %s\n",
                ssid, WiFi.softAPIP().toString().c_str());

  // WebSocket + HTTP
  ws.onEvent(onWebSocketEvent);
  server.addHandler(&ws);
  setupHTTPEndpoints();
  server.begin();
  Serial.println("[HTTP] Servidor iniciado");

  Serial.printf("[INFO] Rodillo Ø%.1fmm | %d imanes | PWM_MIN:%d PWM_MAX:%d\n",
                DRIVE_ROLLER_DIAMETER_MM, MAGNETS_COUNT,
                PID_OUTPUT_MIN, PID_OUTPUT_MAX);
  Serial.println("[INFO] Comandos: SET SP <m/s> | GET VEL | GET ENC | RESET ENC | GET CUR | STOP | TUNE <Kp Ki Kd> | LOG VEL START/STOP");
  Serial.println("[INFO] Encoder: Gira para ajustar setpoint temporal, presiona para CONFIRMAR");
  Serial.println("[INFO] Mantené el botón 10s para abrir el menú dev (Kp/Ki/Kd en vivo)");
}

// ============================================================
// 24. LOOP PRINCIPAL
// ============================================================
// loop: procesa parada de emergencia, lee encoder/serial, calcula velocidad y
// PID event-driven, con timer fallback para garantizar cadencia mínima del PID;
// además lee corriente, transmite estado por WebSocket y refresca LCD/debug
void loop() {
  unsigned long ahora = millis();

  // Emergencia
  if (emergencyStopTriggered) {
    if (!emergencyStopPending) {
      motorStop();
      Serial.println("[EMERGENCIA] ¡Motor detenido!");
      broadcastState();
      emergencyStopPending  = true;
      lastEmergencyDebounce = ahora;
    } else if (ahora - lastEmergencyDebounce >= EMERGENCY_DEBOUNCE_MS) {
      emergencyStopTriggered = false;
      emergencyStopPending   = false;
    }
  }

  // Entradas
  procesarEntradasEncoder();
  leerSerial();

  // Cálculo de velocidad + PID event-driven (se ejecuta en calculateSpeed)
  calculateSpeed();

  // Timer fallback: garantizar mínimo 20 Hz al PID aunque los pulsos Hall sean escasos
  // (ej: cinta frenada con la mano → menos pulsos → PID reaccionaba más lento)
  if (setpointSpeed > 0.0f &&
      (micros() - lastControlMicros) >= (PID_TIMER_INTERVAL_MS * 1000UL)) {
    computePID();
  }

  // Lectura de corriente
  updateCurrentReading();

  // WebSocket
  ws.cleanupClients();
  if (!isWebConnected) {
    if (ahora - lastBlink > 500) {
      lastBlink = ahora;
      digitalWrite(LED_BUILTIN_PIN, !digitalRead(LED_BUILTIN_PIN));
    }
  } else if (ahora - lastWsSendTime > WS_SEND_INTERVAL) {
    lastWsSendTime = ahora;
    broadcastState();
  }

  if (devMenuState != DEV_MENU_OFF) {
    updateLCDDevMenu();
  } else {
    updateLCD();
  }
  debugSerial();

  delay(1);
}